{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"nb_days:0": {"name": "nb_days:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}, "item_id:0": {"name": "item_id:0", "dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}, {"size": "5701"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/axes", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "5701"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/concat_embedding_input/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "40"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/free", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/concat_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/output/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5701"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "101"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5701"}, {"size": "20"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/embedding_item/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "item_id", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, {"name": "nb_days", "op": "Placeholder", "attr": {"dtype": {"type": "DT_INT32"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_41", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_34", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/time"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_32", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/model_5/embedding_item/embedding_lookup", "op": "GatherV2", "input": ["unknown", "item_id", "StatefulPartitionedCall/model_5/embedding_item/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "nb_days", "StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_51", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_87"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_52", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_41", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_88"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_89"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_45", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_34", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_81"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_43", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_32", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_79"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/concat_embedding_input/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_5/embedding_item/embedding_lookup", "StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup", "StatefulPartitionedCall/model_5/concat_embedding_input/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_5/concat_embedding_input/concat", "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/mul_1", "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/add_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/add_1", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/Shape", "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack", "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_1", "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice", "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice", "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/packed/1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_39", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/Shape", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/packed", "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/zeros/packed", "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_50", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_39", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_86"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_38", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_37", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_36", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_35", "op": "Enter", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvbW9kZWxfNS9MU1RNX2NhdDAvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_49", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_38", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_85"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_48", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_37", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_84"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_47", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_36", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_83"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_46", "op": "Merge", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/enter/_35", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_82"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/cond/_30/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_49", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_43"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54", "op": "LoopCond", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/cond/_30/while/Less"]}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_21_switch/_60", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_48", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_50", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_22_switch/_63", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_51", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_20_switch/_59", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_47", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_23_switch/_64", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_52", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_24_switch/_65", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/time_switch/_57", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_45", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter_switch/_55", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_43", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1_switch/_58", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_46", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice_switch/_61", "op": "Switch", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/merge/_49", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/LoopCond/_54"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66", "op": "Identity", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter_switch/_55:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/exit/_70", "op": "Exit", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1_switch/_58"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split/split_dim", "op": "Const", "input": ["^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_86", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_87", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_22_switch/_63:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_88", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_23_switch/_64:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_20_switch/_59:1", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_23_switch/_64:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_89", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_24_switch/_65:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/input/_106", "op": "Identity", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/time_switch/_57:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_2/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_3/y", "op": "Const", "input": ["^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_85", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice_switch/_61:1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/exit/_70", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_62:1", "Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/input/_106", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_2", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/input/_106", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_2/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter_switch/_55:1", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_3/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_22_switch/_63:1"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_81", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_2", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_79", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_3", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose_1", "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/MatMul", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/mul_1", "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_24_switch/_65:1"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/add_1"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split", "op": "Split", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split/split_dim", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/BiasAdd"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2_1", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/Shape", "StatefulPartitionedCall/model_5/output/Tensordot/axes", "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2_1/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/Shape", "StatefulPartitionedCall/model_5/output/Tensordot/free", "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Prod_1", "op": "Prod", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/GatherV2_1", "StatefulPartitionedCall/model_5/output/Tensordot/Const_1"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Prod", "op": "Prod", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/GatherV2", "StatefulPartitionedCall/model_5/output/Tensordot/Const"], "attr": {"T": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/GatherV2", "StatefulPartitionedCall/model_5/output/Tensordot/Const_2", "StatefulPartitionedCall/model_5/output/Tensordot/concat_1/axis"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul", "op": "Mul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid_1", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/input/_21_switch/_60:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/stack", "op": "Pack", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/Prod", "StatefulPartitionedCall/model_5/output/Tensordot/Prod_1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/add_1", "StatefulPartitionedCall/model_5/output/Tensordot/stack"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_84", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/add_1", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/Reshape", "StatefulPartitionedCall/model_5/output/Tensordot/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Sigmoid_2", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot", "op": "Reshape", "input": ["StatefulPartitionedCall/model_5/output/Tensordot/MatMul", "StatefulPartitionedCall/model_5/output/Tensordot/concat_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_83", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul_2", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1_switch/_58:1", "Func/StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/input/_106", "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/model_5/output/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/model_5/output/Tensordot", "StatefulPartitionedCall/model_5/output/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/next_iteration/_82", "op": "NextIteration", "input": ["StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Write/TensorListSetItem", "^StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_body_control/_66"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/model_5/output/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model_5/output/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_5/output/Softmax", "^StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup", "^StatefulPartitionedCall/model_5/embedding_item/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/axes", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/ReadVariableOp", "shape": [64, 5701], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read/ReadVariableOp", "shape": [40, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/zeros/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read_1/ReadVariableOp", "shape": [64, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/Read_2/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/time", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/concat_embedding_input/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/mul", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/batchnorm_inputs/batchnorm/sub", "shape": [40], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/batchnorm_lstm0/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/free", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/Const_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/Tensordot/concat_1/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/output/BiasAdd/ReadVariableOp", "shape": [5701], "dtype": "float32"}, {"name": "unknown_0", "shape": [101, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/embedding_nb_days/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "unknown", "shape": [5701, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_5/embedding_item/embedding_lookup/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/split/split_dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_5/LSTM_cat0/PartitionedCall/while/body/_31/while/TensorArrayV2Read/TensorListGetItem/element_shape", "shape": [2], 